// #define _CRT_SECURE_NO_WARNINGS

// #include <stdio.h>

// // 移位操作符

// // 整数的二进制表示有3种
// // 原码、反码、补码

// // 正的整数的原码、反码、补码都是相同的
// // 负的整数的原码、反码、补码都是要计算的

// // 7 => 111 也就是 2的2次方 + 2的1次方 + 2的0次方 = 4+2+1
// // 00000000000000000000000000000111 - 原码
// // 00000000000000000000000000000111 - 反码
// // 00000000000000000000000000000111 - 补码

// // -7
// // 10000000000000000000000000000111 - 原码
// // 11111111111111111111111111111000 - 反码(原码符号位不变, 其他位按位取反就是反码)
// // 11111111111111111111111111111001 - 补码(反码 + 1)(原码取反 + 1)

// // 整数在内存中存储的是补码
// // 所以移位操作符移动的是补码
// int main(void)
// {
// 	// 7 = 0111
// 	int a = 7;
// 	// 左移操作符:
// 	// 左边丢弃右边补0

// 	int b = a << 1;

// 	printf("%d\n", a);
// 	printf("%d\n", b);

// 	int c = -7; // -7 = 11111111111111111111111111111001
// 	int d = c << 1;
// 	printf("%d\n", c);
// 	printf("%d\n", d);

// 	// 右移操作符:
// 	// 逻辑移位: 右边丢弃左边补0
// 	// 算数移位: 右边丢弃左边补符号位

// 	int e = a >> 1;
// 	int f = c >> 1;
// 	printf("%d\n", e);
// 	printf("%d\n", f);

// 	return 0;
// }