#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>

// 隐式转换
int main(void)
{

	// c的整型算术运算总是至少以缺省的整型类型的精度进行运算
	// 为了获取这个精度, 表达式中的字符和短整型操作数在使用之前被转换为普通整型, 这种转换成为整型提升.

	// 如何进行整型提升?
	// - 整型提升是按照变量的数据类型的符号位来提升的

	// 一个int占4个字节(32个bit)
	// 一个char占1个字节(8个bit)

	char a = 5;
	// int 5的二进制序列
	// 00000000 00000000 00000000 00000101
	// 但5放到char里去只能存8个bit, 所以只能存5的二进制序列的前8位
	// 00000101

	char b = 126;
	// int 126的二进制序列
	// 00000000 00000000 00000000 11111110
	// 126放到char里去只能存8个bit, 所以只能存126的二进制序列的前8位
	// 01111110 (首位要写成0, 因为转换前是正数)

	char c = a + b;
	// 00000000 00000000 00000000 00000101 - a
	// 00000000 00000000 00000000 11111110 - b
	// 00000000 00000000 00000000 10000011 - c
	// 10000011 - c
	// 11111111 11111111 11111111 10000011 - 补码
	// 11111111 11111111 11111111 10000010 - 反码
	// 10000000 00000000 00000000 01111101 - 原码

	printf("%d\n", c); // -125
	return 0;
}